# Parameters
nc: 80 # number of classes
scales: 
  # [depth, width, max_channels]
  s: [0.50, 0.50, 1024] 

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2_DynamicConv, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_DynamicConv, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_DynamicConv, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2_DynamicConv, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [6, 2, FEM, [512]]  
  - [[-2, -1], 1, Concat, [1]]  
  - [-1, 2, C3k2_DynamicConv, [512, False]] # 13 / 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 2, FEM, [256]]  
  - [[-2, -1], 1, Concat, [1]]  
  - [-1, 2, C3k2_DynamicConv, [256, False]] # 16 / 18 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [2, 2, FEM, [128]]  
  - [[-2, -1], 1, Concat, [1]]  
  - [-1, 2, C3k2_DynamicConv, [128, False]] # 19 / 22 (P2/4-xsmall) //

  - [-1, 1, Conv, [128, 3, 2]]
  - [18, 2, FEM, [256]] 
  - [[-2, -1], 1, Concat, [1]] 
  - [-1, 2, C3k2_DynamicConv, [256, False]] # 22 / 26 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [14, 2, FEM, [512]] 
  - [[-2, -1], 1, Concat, [1]] 
  - [-1, 2, C3k2_DynamicConv, [512, False]] # 25 / 30 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [10, 2, FEM, [512]] 
  - [[-2, -1], 1, Concat, [1]] 
  - [-1, 2, C3k2_DynamicConv, [1024, True]] # 28 / 34 (P5/32-large)

  - [[22, 26, 30, 34], 1, Detect_ASFF, [nc]] # Detect(P2, P3, P4, P5)


